[
  {
    "education": [
      {
        "date": "2022 - Present",
        "title": "Bachelor's Degree in Computer Science",
        "complementary": "Universidad Siglo 21",
        "description": "Currently pursuing the advanced cycle of the degree, deepening knowledge in advanced areas such as concurrency, parallelism, enterprise software architecture, software engineering, and IT project management. Developing competencies in technological leadership and organizational management.",
        "link": ""
      },
      {
        "date": "2022 - 2025",
        "title": "Systems Analyst",
        "complementary": "Universidad Siglo 21",
        "description": "Intermediate degree in Computer Science. Specialized in software development, systems analysis, and technological solutions design. Strong foundation in algorithms, data structures, object-oriented programming with Java, SQL databases, software architecture, and agile methodologies. Proficient in requirements analysis, systems design, IT project management, and process optimization. Outstanding skills in problem-solving, teamwork, and effective communication.",
        "link": ""
      },
      {
        "date": "2014 - 2021",
        "title": "Electrician Technician",
        "complementary": "Instituto Mariano Fragueiro",
        "description": "During my studies at 'Instituto Mariano Fragueiro', I acquired skills in the design, installation, and maintenance of electrical systems, along with proficiency in AutoCAD and SketchUp for 2D and 3D design and blueprint reading. I actively participated in practical projects that reinforced my technical understanding.",
        "link": ""
      }
    ],
    "workExperience": [
      {
        "date": "05/2025 - Present",
        "title": "Full Stack Developer",
        "complementary": "NotChatbot",
        "description": "Currently working as a fullstack developer in remote mode, developing real-time web applications. Key participant in the migration to Convex for real-time database functionality, implementing WebSockets for instant data synchronization. Created and published custom NPM packages for the team. Performed maintenance and improvements on webhook integrations with multiple platforms including e-commerce systems and social media applications. Enhanced AI chatbot integration for sales optimization. Designed and maintained modern interfaces using React and Next.js, while managing scalable real-time architectures. Technologies used: React, Next.js, JavaScript, Convex, WebSockets, REST APIs, Webhooks, AI Integration, NPM packages, Tailwind CSS, and Git.",
        "link": "https://www.notchatbot.com/"
      },
      {
        "date": "2024 - Present",
        "title": "Full-Stack Software Developer",
        "complementary": "Freelance",
        "description": "Designed and developed full-stack web applications using technologies like React.js, Next.js, Astro, and Tailwind CSS on the frontend, and Java with Spring Boot on the backend. Implemented security systems with Spring Security and JWT, and managed relational databases (MySQL, PostgreSQL). Utilized Docker for containerizing applications and deployment on VPS with Linux, as well as integrating cloud solutions like Cloudflare R2 (compatible with AWS S3) for scalable storage.",
        "link": ""
      },
      {
        "date": "2021 - Present",
        "title": "Full-Stack Software Developer & Customer Service",
        "complementary": "Vivero Irupé",
        "description": "Family venture with over three years of experience in the customer service sector, where I developed key skills such as effective communication, conflict resolution, and leadership. During this period, I designed and developed Vivero Irupé, a full-stack web application featuring over 200 products.",
        "link": ""
      },
      {
        "date": "2021 - 2024",
        "title": "Specialized Officer in Instrumentation and Control",
        "complementary": "Henisa Sudamericana s.a. & Nucleoeléctrica Argentina s.a.",
        "description": "Experience in multiple projects at the Embalse Nuclear Power Plant during different periods (2021, 2022, and 2024). Performed preventive maintenance and calibration of high-precision equipment such as valves and sensors in critical safety environments. Worked closely with safety teams, applying problem-solving techniques and ensuring compliance with strict safety protocols. During initial internships (2021), gained experience in calibration and measurement of instruments, leak verification in controlled areas, obtaining valuable insight into industrial processes in regulated environments.",
        "link": ""
      }
    ]
  },
  {
    "professionalCourses": [
      {
        "date": "04/2023 to 01/2024",
        "title": "Oracle Next Education F2 T5 Back-end Program",
        "complementary": "ONE - Oracle Next Education - Alura",
        "description": "This back-end course offered an intensive training experience spanning over 330 hours of specialized content. Throughout this course, I consolidated my knowledge in key back-end development technologies, including Java, SQL 'MySQL', Spring, and Oracle Cloud, as well as agile methodologies and programming best practices.",
        "link": "https://app.aluracursos.com/user/andinorodrigo03/fullCertificate/7a7bb74f2a0a42146251f5f83344e9b6"
      },
      {
        "date": "11/2023 to 01/2024",
        "title": "Python, Data Science on OCI and Oracle Analytics",
        "complementary": "ONE - Oracle Next Education - Alura",
        "description": "This course covered the use of Python along with pandas, numpy, matplotlib, seaborn, scikit-learn, Oracle Accelerated Data Science Library (ADSL), and Oracle Analytics Cloud (OAC).",
        "link": "https://app.aluracursos.com/degree/certificate/d17398d7-6350-41f0-b0ff-ac73f416d951"
      }
    ]
  }
]
