[
  {
    "education": [
      {
        "date": "2022 - Cursando",
        "title": "Licenciatura en Informática",
        "description": "Actualmente cursando el tercer año de la carrera en la 'Universidad Siglo 21', con enfoque en algoritmos, estructuras de datos, POO con Java, concurrencia, paralelismo, arquitectura de software, bases de datos (SQL) e ingeniería de software. Además, desarrollo habilidades en liderazgo, trabajo en equipo y gestión organizacional.",
        "link": ""
      },
      {
        "date": "2014 - 2021",
        "title": "Técnico Electricista",
        "description": "Durante mi formación en el 'Instituto Mariano Fragueiro', adquirí habilidades en el diseño, instalación y mantenimiento de sistemas eléctricos, además de destrezas en AutoCAD y SketchUp para diseño en 2D y 3D, y lectura de planos. Participé activamente en proyectos prácticos que reforzaron mi comprensión técnica.",
        "link": ""
      }
    ],
    "workExperience": [
      {
        "date": "2021 - Actualidad",
        "title": "Atención al Cliente",
        "description": "Emprendimiento familiar con más de 2 años de experiencia en el área de atención al cliente, donde adquirí habilidades clave como comunicación efectiva, resolución de conflictos, trabajo en equipo y liderazgo. Apliqué estrategias para mejorar la satisfacción del cliente y optimizar los procesos de atención.",
        "link": ""
      },
      {
        "date": "08/2024 al 10/2024",
        "title": "Instrumentista en la parada de la central nuclear de Embalse 2024",
        "description": "Oficial Especializado en Instrumentación y Control durante la parada de la central nuclear de Embalse, donde realicé mantenimiento preventivo y calibración de equipos de alta precisión, como válvulas y sensores, en un entorno de seguridad crítica. Aplicación de técnicas de resolución de problemas y cumplimiento de estrictos protocolos de seguridad.",
        "link": ""
      },
      {
        "date": "09/2022 al 12/2022",
        "title": "Instrumentista en la parada de la central nuclear de Embalse 2022",
        "description": "Oficial Especializado en Instrumentación y Control con contrato temporal, durante la parada de la central nuclear de Embalse. Participé en la calibración y mantenimiento de sistemas críticos, trabajando en estrecha colaboración con equipos de seguridad para garantizar el correcto funcionamiento de los instrumentos.",
        "link": ""
      },
      {
        "date": "10/2021 al 11/2021",
        "title": "Pasantías realizadas en Instrumentación y Control",
        "description": "Durante esta pasantía, adquirí experiencia en la calibración y medición de instrumentos, sensores y válvulas, así como en la verificación de fugas en áreas controladas. Esta experiencia me brindó una valiosa comprensión de los procesos industriales en un entorno regulado.",
        "link": ""
      }
    ]
  },
  {
    "professionalCourses": [
      {
        "date": "04/2023 al 01/2024",
        "title": "Programa Oracle Next Education F2 T5 Back-end",
        "description": "Curso destinado al Backend con una experiencia formativa intensiva que abarcó más de 330 horas de contenido especializado. Durante este curso, he consolidado mis conocimientos en tecnologías clave del desarrollo back-end, incluyendo Java, SQL 'MySql', Spring, y Oracle Cloud, como ademas de metodologías ágiles y buenas prácticas de programación.",
        "link": "https://app.aluracursos.com/user/andinorodrigo03/fullCertificate/7a7bb74f2a0a42146251f5f83344e9b6"
      },
      {
        "date": "11/2023 al 01/2024",
        "title": "Python, Data Science en OCI y Oracle Analytics",
        "description": "Curso en el que se abarco en el uso de Python junto con pandas, numpy, matplotlib, seaborn, scikit-learn, Oracle Accelerated Data Science Library (ADSL) y Oracle Analytics Cloud (OAC).",
        "link": "https://app.aluracursos.com/degree/certificate/d17398d7-6350-41f0-b0ff-ac73f416d951"
      }
    ]
  }
]
