[
  {
    "education": [
      {
        "date": "2022 - Ongoing",
        "title": "BACHELOR'S DEGREE IN COMPUTER SCIENCE",
        "description": "I am currently in my third year of the program at 'Universidad Siglo 21'.",
        "link": ""
      },
      {
        "date": "2014 - 2021",
        "title": "ELECTRICAL TECHNICIAN",
        "description": "During my high school period at 'Instituto Mariano Fragueiro', I acquired solid skills in the design, installation, and maintenance of electrical systems. I actively participated in practical projects, gaining a practical understanding of the theoretical concepts learned in the classroom.",
        "link": ""
      }
    ]
  },
  {
    "workExperience": [
      {
        "date": "2021 - Present",
        "title": "Customer Service",
        "description": "Family business venture with over 2 years of experience in customer service, acquiring communication, teamwork, and leadership skills.",
        "link": ""
      },
      {
        "date": "09/2022 to 12/2022",
        "title": "Instrumentation Technician during the Shutdown at Embalse Nuclear Power Plant",
        "description": "Specialized Officer in Instrumentation and Control with a temporary contract, during the shutdown of the Embalse nuclear power plant.",
        "link": ""
      },
      {
        "date": "10/2021 to 11/2021",
        "title": "Internship in Instrumentation and Control at Embalse Nuclear Power Plant",
        "description": "This experience provided me with valuable practical understanding of industrial processes, involving calibrations and measurements of measuring instruments, sensors, and valves. Additionally, my work included assisting and verifying leaks in controlled areas.",
        "link": ""
      }
    ]
  },
  {
    "professionalCourses": [
      {
        "date": "03/2023 to 01/2024",
        "title": "Oracle Next Education F2 T5 Back-end Program",
        "description": "A course focused on Backend with an intensive learning experience that covered over 330 hours of specialized content. During this course, I consolidated my knowledge in key back-end development technologies, including Java, SQL 'MySQL', Spring, and Oracle Cloud, along with agile methodologies and programming best practices.",
        "link": "https://app.aluracursos.com/user/andinorodrigo03/fullCertificate/7a7bb74f2a0a42146251f5f83344e9b6"
      },
      {
        "date": "11/2023 to 01/2024",
        "title": "Python, Data Science in OCI, and Oracle Analytics",
        "description": "A course covering the use of Python along with pandas, numpy, matplotlib, seaborn, scikit-learn, Oracle Accelerated Data Science Library (ADSL), and Oracle Analytics Cloud (OAC).",
        "link": "https://app.aluracursos.com/degree/certificate/d17398d7-6350-41f0-b0ff-ac73f416d951"
      }
    ]
  }
]
