[
  {
    "education": [
      {
        "date": "2022 - Cursando",
        "title": "Licenciatura en Informática",
        "complementary": "Universidad Siglo 21",
        "description": "Actualmente cursando el ciclo superior de la carrera, profundizando en áreas avanzadas como concurrencia, paralelismo, arquitectura de software empresarial, ingeniería de software y gestión de proyectos IT. Desarrollo de competencias en liderazgo tecnológico y gestión organizacional.",
        "link": ""
      },
      {
        "date": "2022 - 2025",
        "title": "Analista en Sistemas",
        "complementary": "Universidad Siglo 21",
        "description": "Título intermedio de la Licenciatura en Informática. Especializado en desarrollo de software, análisis de sistemas y diseño de soluciones tecnológicas. Formación sólida en algoritmos, estructuras de datos, programación orientada a objetos con Java, bases de datos SQL, arquitectura de software y metodologías ágiles. Competencias en análisis de requerimientos, diseño de sistemas, gestión de proyectos IT y optimización de procesos. Habilidades destacadas en resolución de problemas, trabajo en equipo y comunicación efectiva.",
        "link": ""
      },
      {
        "date": "2014 - 2021",
        "title": "Técnico Electricista",
        "complementary": "Instituto Mariano Fragueiro",
        "description": "Durante mi formación en el 'Instituto Mariano Fragueiro', adquirí habilidades en el diseño, instalación y mantenimiento de sistemas eléctricos, además de destrezas en AutoCAD y SketchUp para diseño en 2D y 3D, y lectura de planos. Participé activamente en proyectos prácticos que reforzaron mi comprensión técnica.",
        "link": ""
      }
    ],
    "workExperience": [
      {
        "date": "05/2025 - Actualidad",
        "title": "Full Stack Developer",
        "complementary": "NotChatbot",
        "description": "Actualmente me desempeño como desarrollador fullstack en modalidad remota, participando en el desarrollo de aplicaciones web. Realizando diseño, desarrollo y mantenimiento de interfaces utilizando React y Next.js, así como la implementación de APIs utilizando las funcionalidades de Next y gestión de bases de datos relacionales. Tecnologías utilizadas: React, Next.js, JavaScript, APIs REST, Tailwind CSS, bases de datos relacionales y Git.",
        "link": "https://www.notchatbot.com/"
      },
      {
        "date": "2024 - Actualidad",
        "title": "Desarrollador de software - Full Stack",
        "complementary": "Freelance",
        "description": "Diseño y desarrollo aplicaciones web full-stack utilizando tecnologías como React.js, Next.js, Astro y Tailwind CSS en el frontend, y Java con Spring Boot en el backend. Implemente sistemas de seguridad con Spring Security y JWT, y gestiono bases de datos relacionales (MySQL, PostgreSQL). Utilize Docker para contenerizar aplicaciones y despliegue en VPS con Linux, además de integrar soluciones cloud como Cloudflare R2 (compatible con AWS S3) para almacenamiento escalable.",
        "link": ""
      },
      {
        "date": "2021 - Actualidad",
        "title": "Desarrollador web y Atención al Cliente",
        "complementary": "Vivero Irupé",
        "description": "Emprendimiento familiar con más de 3 años de experiencia en atención al cliente, donde desarrollé habilidades clave como comunicación efectiva, resolución de conflictos y liderazgo. Durante este período, diseñé y desarrollé Vivero Irupé, una web full-stack con más de 200 productos.",
        "link": ""
      },
      {
        "date": "2021 - 2024",
        "title": "Oficial Especializado en Instrumentación y Control",
        "complementary": "Henisa Sudamericana s.a. & Nucleoeléctrica Argentina s.a.",
        "description": "Experiencia en múltiples proyectos en la Central Nuclear de Embalse durante diferentes períodos (2021, 2022 y 2024). Realicé mantenimiento preventivo y calibración de equipos de alta precisión como válvulas y sensores en entornos de seguridad crítica. Trabajé en estrecha colaboración con equipos de seguridad, aplicando técnicas de resolución de problemas y asegurando el cumplimiento de estrictos protocolos de seguridad. Durante las pasantías iniciales (2021), adquirí experiencia en calibración y medición de instrumentos, verificación de fugas en áreas controladas, obteniendo valiosa comprensión de procesos industriales en entornos regulados.",
        "link": ""
      }
    ]
  },
  {
    "professionalCourses": [
      {
        "date": "04/2023 al 01/2024",
        "title": "Programa Oracle Next Education F2 T5 Back-end",
        "complementary": "ONE - Oracle Next Education - Alura",
        "description": "Curso destinado al Backend con una experiencia formativa intensiva que abarcó más de 330 horas de contenido especializado. Durante este curso, he consolidado mis conocimientos en tecnologías clave del desarrollo back-end, incluyendo Java, SQL 'MySql', Spring, y Oracle Cloud, como ademas de metodologías ágiles y buenas prácticas de programación.",
        "link": "https://app.aluracursos.com/user/andinorodrigo03/fullCertificate/7a7bb74f2a0a42146251f5f83344e9b6"
      },
      {
        "date": "11/2023 al 01/2024",
        "title": "Python, Data Science en OCI y Oracle Analytics",
        "complementary": "ONE - Oracle Next Education - Alura",
        "description": "Curso en el que se abarco en el uso de Python junto con pandas, numpy, matplotlib, seaborn, scikit-learn, Oracle Accelerated Data Science Library (ADSL) y Oracle Analytics Cloud (OAC).",
        "link": "https://app.aluracursos.com/degree/certificate/d17398d7-6350-41f0-b0ff-ac73f416d951"
      }
    ]
  }
]
